docs/optimal_estimation_class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-27 Mon 13:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#contents">1. Contents</a></li>
<li><a href="#optimal-estimation-class-notes">2. Optimal Estimation Class Notes</a>
<ul>
<li><a href="#kalman-filter-debugging-guide">2.1. Kalman Filter Debugging Guide</a></li>
<li><a href="#class-notes">2.2. Class Notes</a></li>
</ul>
</li>
<li><a href="#video-lectures">3. Video Lectures</a>
<ul>
<li><a href="#project-notes">3.1. Project Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-contents" class="outline-2">
<h2 id="contents"><span class="section-number-2">1.</span> Contents</h2>
<div class="outline-text-2" id="text-contents">
</div>
</div>

<div id="outline-container-optimal-estimation-class-notes" class="outline-2">
<h2 id="optimal-estimation-class-notes"><span class="section-number-2">2.</span> Optimal Estimation Class Notes</h2>
<div class="outline-text-2" id="text-optimal-estimation-class-notes">
</div>
<div id="outline-container-kalman-filter-debugging-guide" class="outline-3">
<h3 id="kalman-filter-debugging-guide"><span class="section-number-3">2.1.</span> Kalman Filter Debugging Guide</h3>
<div class="outline-text-3" id="text-kalman-filter-debugging-guide">
<ul class="org-ul">
<li><a href="docs/optimal_estimation/engineers_guide_to_debugging_an_indirect_extended_kalman_filter.htm">Engineers Guide To Debugging An Indirect Extended Klaman Filter</a></li>
</ul>
</div>
</div>

<div id="outline-container-class-notes" class="outline-3">
<h3 id="class-notes"><span class="section-number-3">2.2.</span> Class Notes</h3>
<div class="outline-text-3" id="text-class-notes">
<ul class="org-ul">
<li>Preliminaries and Math Review
<ul class="org-ul">
<li><a href="docs/optimal_estimation/prelims_lectures_notes.htm">Introduction and Deterministic System Models</a></li>
</ul></li>
<li>Probability Theory and Static Models
<ul class="org-ul">
<li><a href="docs/optimal_estimation/probability_theory_and_static_models_1.htm">Probability Theory and Static Models Part 1</a></li>
<li><a href="docs/optimal_estimation/probability_theory_and_static_models_2.htm">Probability Theory and Static Models Part 2</a></li>
</ul></li>
<li>Stochastic Processes and Linear Dynamic System Model</li>
<li>Optimal Filtering
<ul class="org-ul">
<li><a href="docs/optimal_estimation/optimal_filtering.htm">Optimal Filtering</a></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-video-lectures" class="outline-2">
<h2 id="video-lectures"><span class="section-number-2">3.</span> Video Lectures</h2>
<div class="outline-text-2" id="text-video-lectures">
<ul class="org-ul">
<li>Preliminaries and Math Review
<ul class="org-ul">
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EcL4KWD9H-NMi42mC-gA7C8B-elNw0Y-Osvm59TsOW--xQ?e=P7yhJQ">Lecture 1</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EQr2Y_Pcb-9Po9_Ii3roODgBe_uJAyr6IPVsE69E3vcRYQ?e=ci2wc3">Lecture 2</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EWsLfZuY2BVEjIa246FHV_YBIY9pEtrSu-y7JvkNA2LOOQ?e=PPVOt8">Lecture 3</a></li>
</ul></li>
<li>Probability Theory and Static Models
<ul class="org-ul">
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/ESc98bj7kbtBi1d0jsQCq3oBrhchV_14jhWoMKdw2rjheA?e=HxSmDo">Lecture 1</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EWS6fvfr08ZEgnFGJgQ8uoYBHZVC17bwtAOIVVrze3kfig?e=P0SZgN">Lecture 2</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EQq6Zg-4KCNArlXlt7oWneMBM9LRYwk1jnXGtL0Is5Iurg?e=WCronx">Lecture 3</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EZPEScP0Y3VLsbeYxeGnVm0BUwEQ_8vQoJ1ZJhfMU9xCbA?e=qgB5e8">Lecture 4</a></li>
</ul></li>
<li><p>
Stochastic Processes and Linear Dynamic System Model
</p>
<ul class="org-ul">
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EYb2N62rjGxCiCPJ1saLZCYB9RQP_MvAuZ5xvuBrgPSPDg?e=O6FWdr">Lecture 1</a></li>
</ul>
<p>
-<a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EVhf_JYoRb9AlObbktifCycBkrJ_g9fkEojVCqbcsWUYMw?e=UhcIs4"> Lecture 2</a>
</p>
<ul class="org-ul">
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EVhf_JYoRb9AlObbktifCycBkrJ_g9fkEojVCqbcsWUYMw?e=gvqgrh">Lecture 3</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EaNpjCoArRNOizodNiM3tDQB8WntuF63gYp8QfXMGre3JA?e=Wl0gms">Lecture 4 (Nearly an hour in)</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EWiMTTQWfRpDilHzyZCSL0oB6r7ivbfWiVlC1sa6bP4L3Q?e=o9dkOP">Lecture 5</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EYSu4wl88XNBgdsYizwZHakB4BZseufUPVztaOgGM2xbqQ?e=eCccgq">Lecture 6</a></li>
</ul></li>
<li>Optimal Filtering
<ul class="org-ul">
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EV0NdwAOJRxDp-K-5QXArJoBlQqJMjl6urskjv9uwpac5Q?e=EoumW3">Lecture 1</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EV0NdwAOJRxDp-K-5QXArJoBlQqJMjl6urskjv9uwpac5Q?e=6IjGQg">Lecture 2</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/EW-iadb85hdOoGCYnDQTKS8BSBOJ71JAq5G5oowuollpww?e=QRfxa3">Lecture 3</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/Ed54GoX6Un5LtCAMgEZfOkgBuWmSlgBmtMv-DGDufIftAA?e=W4nmNO">Lecture 4 (40 min)</a></li>
<li><a href="https://usu-my.sharepoint.com/:v:/g/personal/a01704744_aggies_usu_edu/Ed54GoX6Un5LtCAMgEZfOkgBuWmSlgBmtMv-DGDufIftAA?e=t7dM7E">Lecture 5</a></li>
</ul></li>
</ul>
</div>

<div id="outline-container-project-notes" class="outline-3">
<h3 id="project-notes"><span class="section-number-3">3.1.</span> Project Notes</h3>
<div class="outline-text-3" id="text-project-notes">
<ul class="org-ul">
<li><a href="docs/optimal_estimation/trn_project.htm">Terrain Relative Navigation Project</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-02-27 Mon 13:07</p>
</div>
</body>
</html>
